{
  "info": {
    "title": "React Portfolio",
    "text": "In this project, I experienced improvements in code readability and modularity compared to the previous portfolio, which was built with Vanilla JS. \n\n I applied the use of hooks like useState and useEffect, custom hooks, context, components, complex CSS styles, conditional rendering with JSX, and routing with React Router, among other things.",
    "continue": "Continue"
  },
  "description": "I'm a growing web developer, building projects with JavaScript and React while exploring new technologies.",
  "menu": {
    "home": "Home",
    "skills": "Skills",
    "projects": "Projects",
    "exercises": "Exercises",
    "certifications": "Certifications"
  },
  "projects": {
    "info": {
      "title": "Projects section",
      "text": "In this section, I showcase works of my own authorship, whether they are challenges assigned to me in a course or ideas I came up with on my own.",
      "continue": "Continue"
    },
    "rqm": {
      "title": "Random Quote Machine (React)",
      "description": "This must have been my first experience with asynchronous requests to an external API. Using the 'Axios' library in this case and state management in React.",
      "close": "Close",
      "open": "Open project"
    },
    "mdp": {
      "title": "Markdown Previewer (React)",
      "description": "Text formatter to Markdown in which I implemented React's state management and used the 'marked' library.",
      "close": "Close",
      "open": "Open project"
    },
    "dm": {
      "title": "Drum Machine (React)",
      "description": "Sound box in which I implemented state and effect management in React, and grid in CSS.",
      "close": "Close",
      "open": "Open project"
    },
    "calc": {
      "title": "JS Calculator (React)",
      "description": "Calculator in which I put into practice state and effect management in React, and grid in CSS. I also remember that it made me think a lot to solve the logic of each possible situation to make it 'unbreakable'.",
      "close": "Close",
      "open": "Open project"
    },
    "pc": {
      "title": "Pomodoro Clock (React)",
      "description": "In the pomodoro clock I implemented a more advanced handling of the state as well as the effect with the use of callbacks and dependency monitoring. It was not easy to pass all the tests since it has an advanced logic for the level I had up to that point. useRef was also used.",
      "close": "Close",
      "open": "Open project"
    },
    "op": {
      "title": "Old Portfolio (Vanilla JS)",
      "description": "In the old portfolio I was able to put into practice event-driven programming with Vanilla JavaScript and the responsive design.",
      "close": "Close",
      "open": "Open project"
    }
  },

  "exercises": {
    "info": {
      "title": "Exercises section",
      "text": "In this section, I have compiled some work done during courses. That means I didn't do them on my own, but they taught me something.",
      "continue": "Continue"
    },
    "dom": {
      "title": "DOM (Vanilla JS; for PC)",
      "description": "Practical exercise on DOM manipulation with JavaScript, exploring events and dynamically modifying content.",
      "close": "Close",
      "open": "View Exercise"
    },
    "draw": {
      "title": "Draw (Vanilla JS; for PC)",
      "description": "Introduction to creating graphics on the web using the HTML5 Canvas element and JavaScript to draw.",
      "close": "Close",
      "open": "View Exercise"
    },
    "tetris": {
      "title": "Tetris (Vanilla JS)",
      "description": "Implementation of the classic Tetris game using only JavaScript, HTML, and CSS, practicing timing management and DOM manipulation.",
      "close": "Close",
      "open": "View Exercise"
    },
    "monkeytype": {
      "title": "Monkeytype (Vanilla JS; for PC)",
      "description": "Exercise to improve typing speed through creating an interactive application that measures and evaluates typing speed.",
      "close": "Close",
      "open": "View Exercise"
    },
    "excel": {
      "title": "Excel (Vanilla JS; for PC)",
      "description": "In this exercise I put my programming logic into practice. It imitates some basic Excel functions. I intend to continue expanding its functionalities as I find it an interesting challenge.",
      "close": "Close",
      "open": "View Exercise"
    },
    "nextjs-blog": {
      "title": "Blog (Next.js)",
      "description": "Project for beginners. Starting to get familiar with Next.js and its structure. This time it is a blog that uses the 'gray-matter' and 'markdown-it' libraries to format the articles.",
      "close": "Close",
      "open": "View Exercise"
    }
  },
  "certifications": {
    "buttons": {
      "view-more": "View secondary certifications...",
      "view-less": "Hide secondary certifications..."
    },
    "info": {
      "title": "Certifications section",
      "text": "If you click on 'View Certification', for each one (freeCodeCamp) you will be able to see the projects completed during that course.",
      "continue": "Continue"
    },
    "rwd": {
      "title": "Responsive Web Design",
      "description": "Certification covering the essential concepts of web design, including CSS Flexbox, CSS Grid, and responsive design for different screen sizes. If you enter, you will be able to see the projects completed in this course...",
      "close": "Close",
      "open": "View Certification"
    },
    "javascript": {
      "title": "JS Algorithms & Data Structures",
      "description": "Certification covering topics like sorting algorithms, common data structures in JavaScript, and solving complex problems. If you enter, you will be able to see the projects completed in this course...",
      "close": "Close",
      "open": "View Certification"
    },
    "fdl": {
      "title": "Front End Development Libraries",
      "description": "Certification focused on using popular libraries like React, Redux, and tools for building user interfaces.",
      "close": "Close",
      "open": "View Certification"
    },
    "ics": {
      "title": "Introduction to Cybersecurity",
      "description": "I took this course to verify basic knowledge in cybersecurity.",
      "close": "Close",
      "open": "View Certification"
    },
    "html": {
      "title": "HTML",
      "description": "In my first steps in the web world, I attended this introductory course on HTML.",
      "close": "Close",
      "open": "View Certification"
    },
    "html5css3": {
      "title": "HTML5 and CSS3",
      "description": "In my first steps in the web world, I attended this introductory course on HTML5 and CSS3.",
      "close": "Close",
      "open": "View Certification"
    },
    "bbdd": {
      "title": "Introduction to Databases and SQL",
      "description": "In my first steps in the web world, I attended this introductory course on databases and SQL.",
      "close": "Close",
      "open": "View Certification"
    },
    "flash": {
      "title": "Flash",
      "description": "In my first steps in the web world, I attended this introductory course on Flash, but I already had experience using it.",
      "close": "Close",
      "open": "View Certification"
    },
    "presu": {
      "title": "Digital Budgeting",
      "description": "In my first steps in the web world, I attended this course on digital budgeting.",
      "close": "Close",
      "open": "View Certification"
    },
    "photo": {
      "title": "Photoshop",
      "description": "In my first steps in the web world, I attended this Photoshop course.",
      "close": "Close",
      "open": "View Certification"
    },
    "cssdivs": {
      "title": "CSS and DIVs",
      "description": "In my first steps in the web world, I attended this course on CSS and DIVs.",
      "close": "Close",
      "open": "View Certification"
    },
    "jquery": {
      "title": "jQuery",
      "description": "In my first steps in the web world, I attended this jQuery course.",
      "close": "Close",
      "open": "View Certification"
    }
  }
}
