{
  "info": {
    "title": "Portfolio React",
    "text": "En este proyecto, experimenté mejoras en la legibilidad y modularidad del código en comparación con el portfolio anterior, que fue realizado en Vanilla JS. \n\n Puse en práctica el uso de hooks como useState y useEffect, hooks personalizados, contexto, componentes, estilos complejos con CSS, renderizado condicional con JSX, manejo de rutas con React Router, entre otras cosas.",
    "continue": "Continuar"
  },
  "description": "Soy un desarrollador web en crecimiento, creando proyectos con JavaScript y React mientras exploro nuevas tecnologías.",
  "menu": {
    "home": "Inicio",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "exercises": "Ejercicios",
    "certifications": "Certificaciones"
  },
  "projects": {
    "info": {
      "title": "Sección proyectos",
      "text": "En esta sección muestro trabajos de mi autoría, ya sea un desafío que me pidieron en un curso o alguna idea que tuve por mi cuenta.",
      "continue": "Continuar"
    },
    "rqm": {
      "title": "Máquina de Citas Aleatorias (React)",
      "description": "Esta debe haber sido mi primer experiencia con peticiones asíncronas hacia una API externa. Utilizando la librería 'Axios' en este caso y el manejo de estado en React",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    },
    "mdp": {
      "title": "Previsualizdor de Markdown (React)",
      "description": "Formateador de texto a Markdown en el cual puse en práctica el manejo de estado de React y utilicé la librería 'marked'",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    },
    "dm": {
      "title": "Caja de Ritmos (React)",
      "description": "Caja de sonidos en la cual puse en práctica el manejo de estado y de efecto en React, y de grid en Css",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    },
    "calc": {
      "title": "Calculadora JS (React)",
      "description": "Calculadora en la cual puse en práctica el manejo de estado y de efecto en React, y de grid en Css. También recuerdo que me hizo pensar mucho para resolver la lógica de cada posible situación para hacerla 'irrompible'.",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    },
    "pc": {
      "title": "Reloj Pomodoro (React)",
      "description": "En el reloj pomodoro puse en práctica un manejo mas avanzado del estado como también del efecto con la utilización de callbacks y el monitoreo de dependencias. No fue fácil pasar todos los test ya que tiene una lógica avanzada para el nivel que traía hasta ese momento. También se usó useRef.",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    },
    "op": {
      "title": "Portafolio Antiguo (JS Vainilla)",
      "description": "En el viejo portafolio pude poner en práctica la programación orientada a eventos con Vanilla JavaScript y el diseño responsivo.",
      "close": "Cerrar",
      "open": "Abrir proyecto"
    }
  },
  "exercises": {
    "info": {
      "title": "Sección ejercicios",
      "text": "En esta sección recopilo algunos trabajos realizados durante cursos. Es decir, no los hice solo, pero me enseñaron algo.",
      "continue": "Continuar"
    },
    "dom": {
      "title": "DOM (JS Vainilla)",
      "description": "Ejercicio práctico sobre la manipulación del DOM con JavaScript, explorando eventos y modificando el contenido dinámicamente.",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    },
    "draw": {
      "title": "Dibujo (JS Vainilla; para PC)",
      "description": "Introducción a la creación de gráficos en la web usando el elemento Canvas de HTML5 y JavaScript para dibujar.",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    },
    "tetris": {
      "title": "Tetris (JS Vainilla)",
      "description": "Implementación del clásico juego de Tetris usando solo JavaScript, HTML y CSS, poniendo en práctica el manejo del tiempo y la manipulación del DOM.",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    },
    "monkeytype": {
      "title": "Mecanografía (JS Vainilla; para PC)",
      "description": "Ejercicio para mejorar la velocidad de escritura en teclado a través de la creación de una aplicación interactiva que mide y evalúa la velocidad de tipeo.",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    },
    "excel": {
      "title": "Excel (JS Vainilla; para PC)",
      "description": "En este ejercicio puse en práctica mi lógica de programación. Imita algunas funciones básicas de Excel. Pretendo seguir ampliando sus funcionalidades ya que me resulta un desafío interesante. ",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    },
    "nextjs-blog": {
      "title": "Blog (Next.js)",
      "description": "Proyecto para principiantes. Comenzando a familiarizarse con Next.js y su estructura. En esta ocasión se trata de un blog que usa las bibliotecas 'gray-matter' y 'markdown-it' para dar formato a los artículos.",
      "close": "Cerrar",
      "open": "Ver Ejercicio"
    }
  },
  "certifications": {
    "buttons": {
      "view-more": "Ver certificaciones secundarias...",
      "view-less": "Ocultar certificaciones secundarias..."
    },
    "info": {
      "title": "Sección certificaciones",
      "text": "Si ingresas en 'Ver certificación', en cada una de ellas (freeCodeCamp) podrás ver los proyectos realizados en ese curso.",
      "continue": "Continuar"
    },
    "rwd": {
      "title": "Diseño Web Responsivo",
      "description": "Certificación que abarca los conceptos esenciales del diseño web, incluyendo CSS Flexbox, CSS Grid, y diseño adaptable a diferentes tamaños de pantalla.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "javascript": {
      "title": "Algoritmos JS & Estructuras de datos",
      "description": "Certificación en la que se cubren temas como algoritmos de ordenamiento, estructuras de datos comunes en JavaScript, y la resolución de problemas complejos.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "fdl": {
      "title": "Librerías de Desarrollo de Interfaz",
      "description": "Certificación enfocada en el uso de librerías populares como React, Redux, y herramientas para el desarrollo de interfaces de usuario.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "ics": {
      "title": "Introducción a la Ciberseguridad",
      "description": "Realicé este curso para constatar conocimientos básicos en ciberseguridad.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "html": {
      "title": "HTML",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso introductorio a HTML",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "html5css3": {
      "title": "HTM5 y CSS3",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso introductorio a HTML5 y CSS3",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "bbdd": {
      "title": "Introducción a Bases de datos y SQL",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso introductorio bases de datos y sql",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "flash": {
      "title": "Flash",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso introductorio a Flash, pero en realidad ya tenía experiencia usándolo",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "presu": {
      "title": "Presupuesto Web",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso sobre presupuesto digital.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "photo": {
      "title": "Photoshop",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso de Photoshop.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "cssdivs": {
      "title": "CSS y DIVs",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso sobre CSS y DIVs.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    },
    "jquery": {
      "title": "jQuery",
      "description": "En mis primeros pasos en el mundo web, asistí a este curso de jQuery.",
      "close": "Cerrar",
      "open": "Ver Certificación"
    }
  }
}
