{
  "info": {
    "title": "Portfolio em React",
    "text": "Neste projeto, experimentei melhorias na legibilidade e modularidade do código em comparação com o portfolio anterior, que foi feito em Vanilla JS. \n\n Coloquei em prática o uso de hooks como useState e useEffect, hooks personalizados, contexto, componentes, estilos complexos com CSS, renderização condicional com JSX, e gerenciamento de rotas com React Router, entre outras coisas.",
    "continue": "Continuar"
  },
  "description": "Sou um desenvolvedor web em crescimento com foco em Frontend, trabalhando com JavaScript e React enquanto exploro novas tecnologias. Meus fundamentos em lógica de programação me permitem enfrentar desafios técnicos com confiança, buscando sempre melhorar e me adaptar às tendências do mercado.",
  "menu": {
    "home": "Início",
    "skills": "Habilidades",
    "projects": "Projetos",
    "exercises": "Exercícios",
    "certifications": "Certificações"
  },
  "projects": {
    "info": {
      "title": "Seção de projetos",
      "text": "Nesta seção, apresento trabalhos de minha autoria, sejam desafios que me pediram em um curso ou ideias que tive por conta própria.",
      "continue": "Continuar"
    },
    "rqm": {
      "title": "Máquina de Citações Aleatórias (React)",
      "description": "Essa foi provavelmente minha primeira experiência com requisições assíncronas para uma API externa. Utilizando a biblioteca 'Axios' neste caso e o gerenciamento de estado no React.",
      "close": "Fechar",
      "open": "Abrir projeto"
    },
    "mdp": {
      "title": "Visualizador de Markdown (React)",
      "description": "Formatador de texto para Markdown em que pratiquei o gerenciamento de estado no React e utilizei a biblioteca 'marked'.",
      "close": "Fechar",
      "open": "Abrir projeto"
    },
    "dm": {
      "title": "Caixa de Ritmos (React)",
      "description": "Caixa de sons em que pratiquei o gerenciamento de estado e efeitos no React, além de grid no CSS.",
      "close": "Fechar",
      "open": "Abrir projeto"
    },
    "calc": {
      "title": "Calculadora JS (React)",
      "description": "Calculadora onde pratiquei o gerenciamento de estado e efeitos no React, além de grid no CSS. Também me fez pensar bastante para resolver a lógica de cada possível situação e torná-la 'inquebrável'.",
      "close": "Fechar",
      "open": "Abrir projeto"
    },
    "pc": {
      "title": "Relógio Pomodoro (React)",
      "description": "No relógio Pomodoro, pratiquei um gerenciamento mais avançado de estado, além de efeitos utilizando callbacks e monitoramento de dependências. Não foi fácil passar todos os testes, pois tem uma lógica avançada para o nível que eu tinha até aquele momento. Também usei useRef.",
      "close": "Fechar",
      "open": "Abrir projeto"
    },
    "op": {
      "title": "Portfólio Antigo (JS Puro)",
      "description": "No portfólio antigo, pratiquei programação orientada a eventos com JavaScript Puro e design responsivo.",
      "close": "Fechar",
      "open": "Abrir projeto"
    }
  },
  "exercises": {
    "info": {
      "title": "Seção de exercícios",
      "text": "Nesta seção, eu reuni alguns trabalhos realizados durante cursos. Ou seja, não os fiz sozinho, mas eles me ensinaram algo.",
      "continue": "Continuar"
    },
    "dom": {
      "title": "DOM (JS Puro)",
      "description": "Exercício prático sobre a manipulação do DOM com JavaScript, explorando eventos e modificando o conteúdo dinamicamente.",
      "close": "Fechar",
      "open": "Ver Exercício"
    },
    "draw": {
      "title": "Desenho (JS Puro; para PC)",
      "description": "Introdução à criação de gráficos na web usando o elemento Canvas do HTML5 e JavaScript para desenhar.",
      "close": "Fechar",
      "open": "Ver Exercício"
    },
    "tetris": {
      "title": "Tetris (JS Puro)",
      "description": "Implementação do clássico jogo de Tetris usando apenas JavaScript, HTML e CSS, praticando o gerenciamento de tempo e a manipulação do DOM.",
      "close": "Fechar",
      "open": "Ver Exercício"
    },
    "monkeytype": {
      "title": "Digitação (JS Puro; para PC)",
      "description": "Exercício para melhorar a velocidade de digitação através da criação de uma aplicação interativa que mede e avalia a velocidade de digitação.",
      "close": "Fechar",
      "open": "Ver Exercício"
    },
    "excel": {
      "title": "Excel (JS Puro; para PC)",
      "description": "Neste exercício, pratiquei minha lógica de programação. Imita algumas funções básicas do Excel. Pretendo continuar expandindo suas funcionalidades, já que acho um desafio interessante.",
      "close": "Fechar",
      "open": "Ver Exercício"
    },
    "nextjs-blog": {
      "title": "Blog (Next.js)",
      "description": "Projeto para iniciantes. Começando a me familiarizar com Next.js e sua estrutura. Desta vez é um blog que utiliza as bibliotecas 'gray-matter' e 'markdown-it' para formatar os artigos.",
      "close": "Fechar",
      "open": "Ver Exercício"
    }
  },
  "certifications": {
    "buttons": {
      "view-more": "Ver certificações secundárias",
      "view-less": "Ocultar certificações secundárias..."
    },
    "info": {
      "title": "Seção de certificações",
      "text": "Se você clicar em 'Ver Certificação', em cada uma delas (freeCodeCamp) poderá ver os projetos realizados neste curso.",
      "continue": "Continuar"
    },
    "rwd": {
      "title": "Design Web Responsivo",
      "description": "Certificação que abrange os conceitos essenciais do design web, incluindo CSS Flexbox, CSS Grid, e design adaptável para diferentes tamanhos de tela. Se você entrar, poderá ver os projetos realizados neste curso...",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "javascript": {
      "title": "Algoritmos JS & Estruturas de Dados",
      "description": "Certificação que cobre temas como algoritmos de ordenação, estruturas de dados comuns em JavaScript e a resolução de problemas complexos. Se você entrar, poderá ver os projetos realizados neste curso...",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "fdl": {
      "title": "Bibliotecas de Desenvolvimento de Interface",
      "description": "Certificação focada no uso de bibliotecas populares como React, Redux e ferramentas para o desenvolvimento de interfaces de usuário.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "ics": {
      "title": "Introdução à segurança cibernética",
      "description": "Fiz este curso para verificar conhecimentos básicos em segurança cibernética.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "html": {
      "title": "HTML",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso introdutório de HTML.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "html5css3": {
      "title": "HTML5 e CSS3",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso introdutório de HTML5 e CSS3.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "bbdd": {
      "title": "Introdução a Bancos de Dados e SQL",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso introdutório de bancos de dados e SQL.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "flash": {
      "title": "Flash",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso introdutório de Flash, mas já tinha experiência usando-o.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "presu": {
      "title": "Orçamento Digital",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso sobre orçamento digital.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "photo": {
      "title": "Photoshop",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso de Photoshop.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "cssdivs": {
      "title": "CSS e DIVs",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso sobre CSS e DIVs.",
      "close": "Fechar",
      "open": "Ver Certificação"
    },
    "jquery": {
      "title": "jQuery",
      "description": "Nos meus primeiros passos no mundo web, participei deste curso de jQuery.",
      "close": "Fechar",
      "open": "Ver Certificação"
    }
  }
}
